Revit 2026 API

# SlabShapeEditorAddSplitLine Method

---

Add a split line to the element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<SlabShapeCrease> AddSplitLine(
	SlabShapeVertex startVertex,
	SlabShapeVertex endVertex
)
```
```vb
Public Function AddSplitLine (
	startVertex As SlabShapeVertex,
	endVertex As SlabShapeVertex
) As IList(Of SlabShapeCrease)
```
```cpp
public:
IList<SlabShapeCrease^>^ AddSplitLine(
	SlabShapeVertex^ startVertex,
	SlabShapeVertex^ endVertex
)
```
```fsharp
member AddSplitLine :
        startVertex : SlabShapeVertex *
        endVertex : SlabShapeVertex -> IList<SlabShapeCrease>
```

#### Parameters

startVertex SlabShapeVertex
     Start vertex
endVertex SlabShapeVertex
     End vertex

#### Return Value

IListSlabShapeCrease The newly created creases after adding the split line.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Adding a split line may result in multiple creases, for example when the line crosses existing creases or boundary edges.

#### Reference

SlabShapeEditor Class

Autodesk.Revit.DB Namespace